10/data/attachments/c36ee93644d525ec.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Kaitlyn_yourself_Friend_89559_7</nif:username>
            <nif:friendToBeRequested>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>